In [57]:
import pandas as pd

In [5]:
df1 = pd.read_csv("venv/employee_data.csv")

In [6]:
# read all the rows and columns
# sql : select * from employee_data
df1 = pd.read_csv("venv/employee_data.csv")

In [7]:
df1

   EmpID  EmpName Department              JobTitle  Salary  Gender    HireDate
0    101    Alice         HR               Manager   75000  Female  2018-03-15
1    102      Bob         IT     Software Engineer   85000    Male  2019-07-22
2    103  Charlie    Finance               Analyst   65000    Male  2020-01-10
3    104    Diana         IT        Data Scientist   95000  Female  2021-06-25
4    105   Edward      Sales       Sales Executive   55000    Male  2017-09-05
5    106    Fiona  Marketing        SEO Specialist   60000  Female  2020-10-14
6    107   George         HR             Recruiter   58000    Male  2021-02-01
7    108    Helen    Finance            Accountant   70000  Female  2018-11-11
8    109      Ian         IT  System Administrator   78000    Male  2019-12-02
9    110     Jane      Sales         Sales Manager   88000  Female  2016-05-20

In [10]:
type(df)

pandas.core.frame.DataFrame

In [14]:
# read empid & salary from the table.
# sql : select empid,salary from employee_data
df2 = pd.read_csv("venv/employee_data.csv",usecols=['EmpID','Salary'])

In [20]:
df2

   EmpID  Salary
0    101   75000
1    102   85000
2    103   65000
3    104   95000
4    105   55000
5    106   60000
6    107   58000
7    108   70000
8    109   78000
9    110   88000

In [19]:
df2['EmpID']

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: EmpID, dtype: int64

In [22]:
df1[['EmpID','EmpName','Salary']]

   EmpID  EmpName  Salary
0    101    Alice   75000
1    102      Bob   85000
2    103  Charlie   65000
3    104    Diana   95000
4    105   Edward   55000
5    106    Fiona   60000
6    107   George   58000
7    108    Helen   70000
8    109      Ian   78000
9    110     Jane   88000

In [23]:
df_eno_ename_esal =df1[['EmpID','EmpName','Salary']]

In [24]:
type(df_eno_ename_esal)

pandas.core.frame.DataFrame

In [25]:
df_eno_ename_esal.dtypes

EmpID       int64
EmpName    object
Salary      int64
dtype: object

In [26]:
df_eno_ename_esal

   EmpID  EmpName  Salary
0    101    Alice   75000
1    102      Bob   85000
2    103  Charlie   65000
3    104    Diana   95000
4    105   Edward   55000
5    106    Fiona   60000
6    107   George   58000
7    108    Helen   70000
8    109      Ian   78000
9    110     Jane   88000

In [9]:
# 2.Handling Delimiters(file is separated by semi colon ;)
df = pd.read_csv("venv/employee_data.csv", delimiter=';')

In [11]:
# Read the file with appropriate data types
df = pd.read_csv("venv/employee_data.csv",parse_dates=['HireDate'])
# data types of each columns
df.dtypes

EmpID                  int64
EmpName               object
Department            object
JobTitle              object
Salary                 int64
Gender                object
HireDate      datetime64[ns]
dtype: object

In [14]:
# display the date field
df['HireDate']

0   2018-03-15
1   2019-07-22
2   2020-01-10
3   2021-06-25
4   2017-09-05
5   2020-10-14
6   2021-02-01
7   2018-11-11
8   2019-12-02
9   2016-05-20
Name: HireDate, dtype: datetime64[ns]

In [16]:
# extract the year from date
df['HireDate'].dt.year

0    2018
1    2019
2    2020
3    2021
4    2017
5    2020
6    2021
7    2018
8    2019
9    2016
Name: HireDate, dtype: int32

In [17]:
# extrac the month from date
df['HireDate'].dt.month

0     3
1     7
2     1
3     6
4     9
5    10
6     2
7    11
8    12
9     5
Name: HireDate, dtype: int32

In [18]:
# extrac the day from date
df['HireDate'].dt.day

0    15
1    22
2    10
3    25
4     5
5    14
6     1
7    11
8     2
9    20
Name: HireDate, dtype: int32

In [20]:
# extrac the weekday from date
df['HireDate'].dt.weekday

0    3
1    0
2    4
3    4
4    1
5    2
6    0
7    6
8    0
9    4
Name: HireDate, dtype: int32

In [21]:
df.dtypes

EmpID                  int64
EmpName               object
Department            object
JobTitle              object
Salary                 int64
Gender                object
HireDate      datetime64[ns]
dtype: object

In [29]:
# Can we convert the datatype while reading the data from file ( e.g. ) salary field to be convereted from float to int
df = pd.read_csv("venv/employee_data.csv",parse_dates=['HireDate'],dtype={"EmpID":float})

In [27]:
df.dtypes

EmpID                  int64
EmpName               object
Department            object
JobTitle              object
Salary                 int64
Gender                object
HireDate      datetime64[ns]
dtype: object

In [30]:
df

   EmpID  EmpName Department              JobTitle  Salary  Gender   HireDate
0  101.0    Alice         HR               Manager   75000  Female 2018-03-15
1  102.0      Bob         IT     Software Engineer   85000    Male 2019-07-22
2  103.0  Charlie    Finance               Analyst   65000    Male 2020-01-10
3  104.0    Diana         IT        Data Scientist   95000  Female 2021-06-25
4  105.0   Edward      Sales       Sales Executive   55000    Male 2017-09-05
5  106.0    Fiona  Marketing        SEO Specialist   60000  Female 2020-10-14
6  107.0   George         HR             Recruiter   58000    Male 2021-02-01
7  108.0    Helen    Finance            Accountant   70000  Female 2018-11-11
8  109.0      Ian         IT  System Administrator   78000    Male 2019-12-02
9  110.0     Jane      Sales         Sales Manager   88000  Female 2016-05-20

In [32]:
# Read sepcific row ( index number = 1)
df.iloc[1]

EmpID                       102.0
EmpName                       Bob
Department                     IT
JobTitle        Software Engineer
Salary                      85000
Gender                       Male
HireDate      2019-07-22 00:00:00
Name: 1, dtype: object

In [33]:
# Read specific rows ( index no. 1 to 5) 
df.iloc[5:10:1]

   EmpID EmpName Department              JobTitle  Salary  Gender   HireDate
5  106.0   Fiona  Marketing        SEO Specialist   60000  Female 2020-10-14
6  107.0  George         HR             Recruiter   58000    Male 2021-02-01
7  108.0   Helen    Finance            Accountant   70000  Female 2018-11-11
8  109.0     Ian         IT  System Administrator   78000    Male 2019-12-02
9  110.0    Jane      Sales         Sales Manager   88000  Female 2016-05-20

In [ ]:
# How can we read only row number 5 to 10 from the file.
df = pd.read_csv("venv/employee_data.csv",skiprows=5,nrows=5,header=None,names=["EID","EName","Dept","JobTitle","Sal","Gen","Doj"])

In [47]:
df

   105  Edward      Sales       Sales Executive  55000    Male  2017-09-05
0  106   Fiona  Marketing        SEO Specialist  60000  Female  2020-10-14
1  107  George         HR             Recruiter  58000    Male  2021-02-01
2  108   Helen    Finance            Accountant  70000  Female  2018-11-11
3  109     Ian         IT  System Administrator  78000    Male  2019-12-02
4  110    Jane      Sales         Sales Manager  88000  Female  2016-05-20

In [45]:
df = pd.read_csv("venv/employee_data.csv",header=5)

In [46]:
df

   105  Edward      Sales       Sales Executive  55000    Male  2017-09-05
0  106   Fiona  Marketing        SEO Specialist  60000  Female  2020-10-14
1  107  George         HR             Recruiter  58000    Male  2021-02-01
2  108   Helen    Finance            Accountant  70000  Female  2018-11-11
3  109     Ian         IT  System Administrator  78000    Male  2019-12-02
4  110    Jane      Sales         Sales Manager  88000  Female  2016-05-20

In [ ]:
# Read a csv file with semi colon as seperator ( delimiter )
df = pd.read_csv(venv/"employee_data.csv",delimiter=";")

In [49]:
df

   105  Edward      Sales       Sales Executive  55000    Male  2017-09-05
0  106   Fiona  Marketing        SEO Specialist  60000  Female  2020-10-14
1  107  George         HR             Recruiter  58000    Male  2021-02-01
2  108   Helen    Finance            Accountant  70000  Female  2018-11-11
3  109     Ian         IT  System Administrator  78000    Male  2019-12-02
4  110    Jane      Sales         Sales Manager  88000  Female  2016-05-20

In [ ]:
# Read a csv file with semi colon as seperator ( delimiter )
df = pd.read_csv(venv/"employee_data.csv",delimiter=",")

In [50]:
df

   105  Edward      Sales       Sales Executive  55000    Male  2017-09-05
0  106   Fiona  Marketing        SEO Specialist  60000  Female  2020-10-14
1  107  George         HR             Recruiter  58000    Male  2021-02-01
2  108   Helen    Finance            Accountant  70000  Female  2018-11-11
3  109     Ian         IT  System Administrator  78000    Male  2019-12-02
4  110    Jane      Sales         Sales Manager  88000  Female  2016-05-20

In [ ]:
# Read the zipped file
df = pd.read_csv("venv/employee_data.csv.gz",compression='gzip')

In [53]:
df

   105  Edward      Sales       Sales Executive  55000    Male  2017-09-05
0  106   Fiona  Marketing        SEO Specialist  60000  Female  2020-10-14
1  107  George         HR             Recruiter  58000    Male  2021-02-01
2  108   Helen    Finance            Accountant  70000  Female  2018-11-11
3  109     Ian         IT  System Administrator  78000    Male  2019-12-02
4  110    Jane      Sales         Sales Manager  88000  Female  2016-05-20

In [ ]:
# peformance optimization ( chunksize)
df =pd.read_csv("venv/employee_data.csv.gz")

In [54]:
df

   105  Edward      Sales       Sales Executive  55000    Male  2017-09-05
0  106   Fiona  Marketing        SEO Specialist  60000  Female  2020-10-14
1  107  George         HR             Recruiter  58000    Male  2021-02-01
2  108   Helen    Finance            Accountant  70000  Female  2018-11-11
3  109     Ian         IT  System Administrator  78000    Male  2019-12-02
4  110    Jane      Sales         Sales Manager  88000  Female  2016-05-20

In [59]:
for cnk in pd.read_csv("venv/employee_data.csv",chunksize=5):
    print(cnk)

   EmpID  EmpName Department           JobTitle  Salary  Gender    HireDate
0    101    Alice         HR            Manager   75000  Female  15-03-2018
1    102      Bob         IT  Software Engineer   85000    Male  22-07-2019
2    103  Charlie    Finance            Analyst   65000    Male  10-01-2020
3    104    Diana         IT     Data Scientist   95000  Female  25-06-2021
4    105   Edward      Sales    Sales Executive   55000    Male  05-09-2017
   EmpID EmpName Department              JobTitle  Salary  Gender    HireDate
5    106   Fiona  Marketing        SEO Specialist   60000  Female  14-10-2020
6    107  George         HR             Recruiter   58000    Male  01-02-2021
7    108   Helen    Finance            Accountant   70000  Female  11-11-2018
8    109     Ian         IT  System Administrator   78000    Male  02-12-2019
9    110    Jane      Sales         Sales Manager   88000  Female  20-05-2016

In [ ]:
# Low memory = True ( default ) this is file reading during chunk might be data corruption this is performance point of view
df = pd.read_csv("venv/employee_data.csv",low_memory=True)

# To avoid any data corruption, we should set low_memory flag as False

In [60]:
df.head(10)

   105  Edward      Sales       Sales Executive  55000    Male  2017-09-05
0  106   Fiona  Marketing        SEO Specialist  60000  Female  2020-10-14
1  107  George         HR             Recruiter  58000    Male  2021-02-01
2  108   Helen    Finance            Accountant  70000  Female  2018-11-11
3  109     Ian         IT  System Administrator  78000    Male  2019-12-02
4  110    Jane      Sales         Sales Manager  88000  Female  2016-05-20

In [61]:
df.tail(4)

   105  Edward    Sales       Sales Executive  55000    Male  2017-09-05
1  107  George       HR             Recruiter  58000    Male  2021-02-01
2  108   Helen  Finance            Accountant  70000  Female  2018-11-11
3  109     Ian       IT  System Administrator  78000    Male  2019-12-02
4  110    Jane    Sales         Sales Manager  88000  Female  2016-05-20

In [64]:
df = pd.read_csv("venv/employee_data.csv",parse_dates=['HireDate'])
df['HireDate'].head()
df.dtypes

C:\Users\Admin\AppData\Local\Temp\ipykernel_8308\1555331484.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df = pd.read_csv("venv/employee_data.csv",parse_dates=['HireDate'])

EmpID                  int64
EmpName               object
Department            object
JobTitle              object
Salary                 int64
Gender                object
HireDate      datetime64[ns]
dtype: object

In [ ]:
df['HireDate'] = df['HireDate'].dt.strftime('%m-%d-%y')

In [66]:
df.dtypes

EmpID                  int64
EmpName               object
Department            object
JobTitle              object
Salary                 int64
Gender                object
HireDate      datetime64[ns]
dtype: object

In [67]:
df = pd.read_csv("venv/employee_data.csv",parse_dates=['HireDate'])
df['HireDate'].head()

C:\Users\Admin\AppData\Local\Temp\ipykernel_8308\4007156047.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df = pd.read_csv("venv/employee_data.csv",parse_dates=['HireDate'])

0   2018-03-15
1   2019-07-22
2   2020-01-10
3   2021-06-25
4   2017-09-05
Name: HireDate, dtype: datetime64[ns]